
#############################################################################################################
#############################################################################################################
#############################################################################################################
##                          Selenium 시작                   #################################################
#############################################################################################################
#############################################################################################################
#############################################################################################################
#############################################################################################################


#install.packages("RSelenium")
#install.packages("wdman")
library(RSelenium)
library(wdman)
library(dplyr)
library(magrittr)
library(rvest)


driver<- rsDriver(port=4445L,browser = "chrome",verbose = FALSE, check = FALSE)

remDr <- driver$client


player_runner_record <- list()


for( j in 1:10){
  
  Sys.setlocale("LC_ALL", "English")
  
  #############################################################################################################
  #############################################################################################################
  #############################################################################################################
  ##                    기본기록 첫번째 crwaling                               ################################
  #############################################################################################################
  #############################################################################################################
  #############################################################################################################
  #############################################################################################################
  
  
  
  remDr$navigate("https://www.koreabaseball.com/Record/Player/Runner/Basic.aspx")
  
  
  ##############################################################################################################
  ############ 팀선택 옵션 클릭 및 선택       ##################################################################
  ##############################################################################################################
  # 2 : 넥센                                  ##################################################################
  # 3 : 두산                                  ##################################################################                                  
  # 4 : 롯데                                  ##################################################################
  # 5 : 삼성                                  ##################################################################
  # 6 : 한화                                  ##################################################################
  # 7 : KIA                                   ##################################################################
  # 8 : KT                                    ##################################################################
  # 9 : LG                                    ##################################################################
  # 10 : NC                                   ##################################################################
  # 11 : SK                                   ##################################################################
  ##############################################################################################################
  ##############################################################################################################
  ##############################################################################################################
  
  team_select <- remDr$findElement(using = 'xpath', value = sprintf('//*[@id="cphContents_cphContents_cphContents_ddlTeam_ddlTeam"]/option[%s]',j+1))
  
  team_select$clickElement()
  
  Sys.sleep(2)
  
  data_runner_1_1 = list()
  data_runner_1_2 = list()
  data_runner_1_3 = list()
  
  ## 기본기록 버튼클릭(1페이지)
  try({
    
    morereviews <- remDr$findElement(using = 'id', value = "cphContents_cphContents_cphContents_ucPager_btnNo1")
    
    
    morereviews$clickElement()
    Sys.sleep(4)
    webElem <-remDr$findElement(using = "class", value = "record_result")
    results <- webElem$getElementText()
    
    webElem5txt <- webElem$getElementAttribute("outerHTML")
    
    page_source <- remDr$getPageSource()
    
    data_runner_1_1[[j]] = read_html(page_source[[1]]) %>% html_nodes("table") %>% html_table() %>% extract2(1)
    
  },silent=T)
  ## 기본기록 버튼클릭(2페이지)
  
  
  try({
    morereviews <- remDr$findElement(using = 'id', value = "cphContents_cphContents_cphContents_ucPager_btnNo2")
    
    morereviews$clickElement()
    Sys.sleep(2)
    
    webElem <-remDr$findElement(using = "class", value = "record_result")
    results <- webElem$getElementText()
    
    webElem5txt <- webElem$getElementAttribute("outerHTML")
    
    page_source <- remDr$getPageSource()
    
    data_runner_1_2[[j]] = read_html(page_source[[1]]) %>% html_nodes("table") %>% html_table() %>% extract2(1)
    
  },silent=T)
  
  ## 기본기록 버튼클릭(3페이지)
  
  try({
    morereviews <- remDr$findElement(using = 'id', value = "cphContents_cphContents_cphContents_ucPager_btnNo3")
    
    morereviews$clickElement()
    Sys.sleep(2)
    
    webElem <-remDr$findElement(using = "class", value = "record_result")
    results <- webElem$getElementText()
    
    webElem5txt <- webElem$getElementAttribute("outerHTML")
    
    page_source <- remDr$getPageSource()
    
    data_runner_1_3[[j]] = read_html(page_source[[1]]) %>% html_nodes("table") %>% html_table() %>% extract2(1)
    
  },silent=T)
  
  
  #############################################################################################################
  #############################################################################################################
  #############################################################################################################
  ####                      데이터 통합                                       #################################
  #############################################################################################################
  #############################################################################################################
  #############################################################################################################
  #############################################################################################################
  
  try({
    if(is.null(data_runner_1_1[[j]]) == FALSE) {data_runner_1_1[[j]]$`SB%` = as.character(data_runner_1_1[[j]]$`SB%`)}
    if(is.null(data_runner_1_2[[j]]) == FALSE) {data_runner_1_2[[j]]$`SB%` = as.character(data_runner_1_2[[j]]$`SB%`)}
    if(is.null(data_runner_1_3[[j]]) == FALSE) {data_runner_1_3[[j]]$`SB%` = as.character(data_runner_1_3[[j]]$`SB%`)}  
  },silent = T)
  
  
  runner_A = bind_rows(data_runner_1_1,data_runner_1_2,data_runner_1_3)[,-1]
  
  Sys.setlocale("LC_ALL", "Korean")
  
  player_runner_record[[j]] = runner_A
  
  
}


######################################################################
#####       데이터 저장 ##############################################
######################################################################

write.csv(data.frame(season="2018",bind_rows(player_runner_record)),"~/player_runner_record.csv",row.names = FALSE)


## 셀레니움 종료

remDr$close()

## 드라이버 사용종료

rm(driver)

## 메모리 삭제

gc()